DataProcessors/ПубликацияВакансийНаРекрутинговыхСайтах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПубликацияВакансийНаРекрутинговыхСайтах</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДанныеПубликацииВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПубликацииВакансий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПубликацияВакансий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПубликацияВакансий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВакансии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакансия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоПубликации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Вакансии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Вакансии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаПодборПерсонала</xr:Item>
				<xr:Item>Catalog.ПрофилиДолжностей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредполагаемыйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаЗакрытия</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияВакансии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПодборПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетПрофилюДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Требования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеНабора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеНабораПерсоналаНаВакансию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХарактеристикиПерсонала</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ХарактеристикиПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПроверка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбучение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесЗначения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДействияСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыРаботыСКандидатами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапРаботы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ИнструментОценкиХарактеристикПерсонала</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОценкиХарактеристик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОценкиХарактеристик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПубликацияВакансийНаРекрутинговыхСайтах/Forms/НастройкаПубликации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Вакансия = Параметры.Вакансия;
	Сайт = Параметры.Сайт;
	ИдентификаторВакансии = Параметры.ИдентификаторВакансии;
	Элементы.СсылкаНаВакансию.Заголовок = Параметры.АдресПубликации;
	
	ПервичнаяПубликация = Не ЗначениеЗаполнено(ИдентификаторВакансии);
	ПовторнаяПубликация = Параметры.ПовторнаяПубликация;
	
	ДанныеСайтов = РекрутинговыеСайты.ДанныеСайтов(Сайт);

	СинхронизироватьСвойстваПубликацииВакансии();
	
	Элементы.ДеревоНастроекПубликацияВакансии.Заголовок = Сайт;
	
	НастроитьКомандыИДеревоНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Оповестить("ПубликацияВакансии");
	ЗагрузитьКлассификаторы(Сайт);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаВакансиюНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.Заголовок) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Элемент.Заголовок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ЭлементСТекстомВHTML(ТекущиеДанные.Путь, ЭлементыСТекстомВHTML) Тогда
			СтандартнаяОбработка = Ложь;
			РедактированиеТекстаВHTML(ТекущиеДанные);
		КонецЕсли;
		
		Если ТипЗнч(ТекущиеДанные.Показатель) = Тип("СправочникСсылка.Вакансии") Тогда
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.Показатель);
			ОткрытьФорму("Справочник.Вакансии.Форма.ФормаЭлемента", СтруктураПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	
	Если ТекущиеДанные.ТипРеквизита = "Строка" Тогда
		
		Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		
		Если ЭлементСодержитТекст(ТекущиеДанные.Путь, ЭлементыСМногострочнымВводом, ЭлементыСТекстомВHTML) Тогда
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.КнопкаВыбора = Истина;
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.РедактированиеТекста = Ложь;
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.РежимРедактирования = РежимРедактированияКолонки.Вход;
		Иначе
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.КнопкаВыбора = Ложь;
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.РедактированиеТекста = Истина;
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.ТипРеквизита = "Число" Тогда
		Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ИначеЕсли ТекущиеДанные.ТипРеквизита = "Булево" Тогда
		Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.ОграничениеТипа = Новый ОписаниеТипов("Булево");
	ИначеЕсли ТекущиеДанные.ТипРеквизита = "Начало массива" 
		Или ТекущиеДанные.ТипРеквизита = "Начало объекта" Тогда
		
		Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
		Если ЗначениеЗаполнено(ЭлементыНедоступныеДляРедактирования)
			И ЭлементыНедоступныеДляРедактирования.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
			
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.КнопкаВыбора = Ложь;
		Иначе
			Элемент.ПодчиненныеЭлементы.ДеревоНастроекПубликацияВакансии.КнопкаВыбора = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПубликацияВакансииПриИзменении(Элемент)
	
	ПриИзмененииЗначенияПубликацииВакансии();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПубликацияВакансииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	СоответствиеПутиИКлассификатора = ДанныеСайтов[Сайт].СоответствиеПутиИКлассификатора;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыНедоступныеДляРедактирования)
		И ЭлементыНедоступныеДляРедактирования.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСМножественнымВыборомИзДерева) 
		И ЭлементыСМножественнымВыборомИзДерева.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Классификатор", СоответствиеПутиИКлассификатора.Получить(ТекущиеДанные.Путь)); 
		СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
		СтруктураПараметров.Вставить("ВыбранныеСтроки", ТекущиеДанные.ПубликацияВакансии);
		СтруктураПараметров.Вставить("ИспользуемыеСайты", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сайт));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		
		ВыборИзДереваЗначений(СтруктураПараметров, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСОдиночнымВыборомИзДерева)
		И ЭлементыСОдиночнымВыборомИзДерева.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Классификатор", СоответствиеПутиИКлассификатора.Получить(ТекущиеДанные.Путь)); 
		СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
		СтруктураПараметров.Вставить("ИспользуемыеСайты", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сайт));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		
		ВыборИзДереваЗначений(СтруктураПараметров, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСОдиночнымВыборомИзСписка) 
		И ЭлементыСОдиночнымВыборомИзСписка.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокВыбора = СписокВыбораНаСервере(СоответствиеПутиИКлассификатора.Получить(ТекущиеДанные.Путь));
		
		ОдиночныйВыборИзСписка(ТекущиеДанные, СписокВыбора);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСМножественнымВыборомИзСписка)
		И ЭлементыСМножественнымВыборомИзСписка.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокВыбора = СписокВыбораНаСервере(СоответствиеПутиИКлассификатора.Получить(ТекущиеДанные.Путь));
		
		МножественныйВыборИзСписка(ТекущиеДанные, СписокВыбора);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСоСпискомБезКлассификатора)
		И ЭлементыСоСпискомБезКлассификатора.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		Если Элемент.Родитель.ТекущиеДанные.ПубликацияВакансии = Неопределено Тогда
			Элемент.Родитель.ТекущиеДанные.ПубликацияВакансии = Новый СписокЗначений;
		КонецЕсли;
		
		Элемент.Родитель.ТекущиеДанные.ПубликацияВакансии = Элемент.ОграничениеТипа.ПривестиЗначение(Элемент.Родитель.ТекущиеДанные.ПубликацияВакансии);
		Элемент.Родитель.ТекущиеДанные.ПубликацияВакансии.ТипЗначения = Новый ОписаниеТипов("Строка");
		
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементыСоСпециальнойФормойРедактированияСписка)
		И ЭлементыСоСпециальнойФормойРедактированияСписка.Найти(ТекущиеДанные.Путь) <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеСайта = ДанныеСайтов[Сайт];
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		
		Если(ТекущиеДанные.Путь = "contacts.phones" 
			Или ТекущиеДанные.Путь = "phones"
			Или ТекущиеДанные.Путь = "contact.phones") Тогда
			
			СписокТелефонов = Новый СписокЗначений;
			ИменаСвойств = ДанныеСайта.ИменаСвойствТелефона;
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ПубликацияВакансии)
				И ЗначениеЗаполнено(ИменаСвойств) Тогда
				
				Для Каждого Телефон Из ТекущиеДанные.ПубликацияВакансии Цикл
					
					СтруктураТелефона = Новый Структура;
					СтруктураТелефона.Вставить("КодСтраны", Телефон.Значение[ИменаСвойств.КодСтраны]);
					СтруктураТелефона.Вставить("КодГорода", Телефон.Значение[ИменаСвойств.КодГорода]);
					СтруктураТелефона.Вставить("НомерТелефона", Телефон.Значение[ИменаСвойств.НомерТелефона]);
					СтруктураТелефона.Вставить("Комментарий", Телефон.Значение[ИменаСвойств.Комментарий]);
					
					СписокТелефонов.Добавить(СтруктураТелефона);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ДополнительныеПараметры.Вставить("СписокТелефонов", СписокТелефонов);
			
			РедактированияСпискаТелефонов(ДополнительныеПараметры);
			
		ИначеЕсли (ТекущиеДанные.Путь = "languages" 
			Или ТекущиеДанные.Путь = "language") Тогда
			
			ЗнанияЯзыков = Новый СписокЗначений;
			ИменаСвойств = ДанныеСайта.ИменаСвойствЗнанияЯзыка;
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ПубликацияВакансии)
				И ЗначениеЗаполнено(ИменаСвойств) Тогда
				
				Для Каждого ЗнаниеЯзыка Из ТекущиеДанные.ПубликацияВакансии Цикл
					
					ОбъектЯзык = ЗнаниеЯзыка.Значение[ИменаСвойств.ОбъектЯзык];
					ОбъектУровень = ЗнаниеЯзыка.Значение[ИменаСвойств.ОбъектУровень];
					
					Язык = Новый СписокЗначений;
					Язык.Добавить(ОбъектЯзык[ИменаСвойств.ИдЯзыка], ОбъектЯзык[ИменаСвойств.НазваниеЯзыка]);
					
					Уровень = Новый СписокЗначений;
					Уровень.Добавить(ОбъектУровень[ИменаСвойств.ИдУровня], ОбъектУровень[ИменаСвойств.НазваниеУровня]);
					
					СтруктураЗнанияЯзыка = Новый Структура;
					СтруктураЗнанияЯзыка.Вставить("Язык", Язык);
					СтруктураЗнанияЯзыка.Вставить("Уровень", Уровень);
					
					ЗнанияЯзыков.Добавить(СтруктураЗнанияЯзыка);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ДополнительныеПараметры.Вставить("СписокЯзыков", ЗнанияЯзыков);
			
			РедактированиеУровняВладенияЯзыками(ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭлементСМногострочнымВводом(ТекущиеДанные.Путь, ЭлементыСМногострочнымВводом) Тогда
		СтандартнаяОбработка = Ложь;
		РедактированиеМногострочногоТекста(ТекущиеДанные);
	КонецЕсли;
	
	Если ЭлементСТекстомВHTML(ТекущиеДанные.Путь, ЭлементыСТекстомВHTML) Тогда
		СтандартнаяОбработка = Ложь;
		РедактированиеТекстаВHTML(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Опубликовать(Команда)
	
	ОчиститьСообщения();
	
	Если ПервичнаяПубликация Тогда
		РезультатДействия = ОпубликоватьВакансию();
	ИначеЕсли ПовторнаяПубликация Тогда
		РезультатДействия = ПовторноОпубликоватьВакансию();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатДействия) Тогда
		Если РезультатДействия.Успешно Тогда
			Если РезультатДействия.Тарифы.Количество() <> 0 Тогда
				ИдентификаторВакансии = РезультатДействия.ИдентификаторВакансии;
				ВыбратьТариф(РезультатДействия.Тарифы);
			Иначе
				ОпубликоватьВакансиюЗавершение();
			КонецЕсли;
		ИначеЕсли ПовторнаяПубликация Тогда
			ПредложитьРазмещениеНовойВакансии(РезультатДействия.ТекстОшибки);
		Иначе
			Если ЗначениеЗаполнено(РезультатДействия.ИдентификаторВакансии) Тогда
				ИдентификаторВакансии = РезультатДействия.ИдентификаторВакансии;
				НастроитьФормуПослеСозданияПубликации();
			КонецЕсли;
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатДействия.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПубликацию(Команда)
	
	ОчиститьСообщения();
	
	РезультатДействия = ОбновитьПубликациюВакансии();
	
	Если ЗначениеЗаполнено(РезультатДействия) Тогда
		
		Если РезультатДействия.Успешно Тогда
			ОбновитьПубликациюВакансииЗавершение();
		Иначе
			ПредложитьРазмещениеНовойВакансии(РезультатДействия.ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьКлассификаторы(Сайт)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьКлассификаторыЗавершение", ЭтотОбъект);
	
	РекрутинговыеСайтыКлиент.НачатьЗагрузкуКлассификаторов(
		ЭтотОбъект, ОповещениеОЗавершении, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сайт));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификаторыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		Классификаторы = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если Не ЗначениеЗаполнено(Классификаторы[Сайт]) Тогда
			Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
			Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок =
				НСтр("ru = 'Произошла ошибка загрузки классификаторов. Подробности в журнале регистрации'");
			Возврат;
		КонецЕсли;
		
		РекрутинговыеСайтыКлиент.СохранитьКлассификаторы(Классификаторы, ДанныеСайтов);
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаКлассификаторыЗагружены;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
		Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок =
			СтрШаблон(НСтр("ru = 'Произошла ошибка загрузки классификаторов: %1'"), Результат.КраткоеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Отменено" Тогда
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
		Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок = 
			СтрШаблон(НСтр("ru = 'Загрузка классификаторов отменена. Обратитесь к администратору.'"));
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьКомандыИДеревоНастроек()
	
	Элементы.ДеревоНастроекВакансияВПрограмме.Видимость = Не ПервичнаяПубликация;
	
	ОбновлениеПубликации = Не ПервичнаяПубликация И Не ПовторнаяПубликация;
	
	Элементы.Опубликовать.Видимость = Не ОбновлениеПубликации;
	Элементы.ОбновитьПубликацию.Видимость = ОбновлениеПубликации;
	Элементы.ОбновитьПубликацию.КнопкаПоУмолчанию = ОбновлениеПубликации;
	
	ВидыПолей = РекрутинговыеСайты.ВидыПолей(Сайт, ОбновлениеПубликации);
	
	ЭлементыСМножественнымВыборомИзСписка = ВидыПолей.СМножественнымВыборомИзСписка;
	ЭлементыСОдиночнымВыборомИзСписка = ВидыПолей.СОдиночнымВыборомИзСписка;
	ЭлементыСоСпискомБезКлассификатора = ВидыПолей.СоСпискомБезКлассификатора;
	ЭлементыСоСпециальнойФормойРедактированияСписка = ВидыПолей.СоСпециальнойФормойРедактированияСписка;
	ЭлементыСМножественнымВыборомИзДерева = ВидыПолей.СМножественнымВыборомИзДерева;
	ЭлементыСОдиночнымВыборомИзДерева = ВидыПолей.СОдиночнымВыборомИзДерева;
	ЭлементыНедоступныеДляРедактирования = ВидыПолей.НедоступныеДляРедактирования;
	ЭлементыСТекстомВHTML = ВидыПолей.СТекстомВHTML;
	ЭлементыСМногострочнымВводом = ВидыПолей.СМногострочнымВводом;
	
	ОбновитьДерево(ОбновлениеПубликации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОдиночныйВыборИзСписка(ТекущиеДанные, СписокВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Оповещение  = Новый ОписаниеОповещения("ПоказатьВыборЭлементаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	НачальноеЗначение = Неопределено;
	
	Если ТипЗнч(ТекущиеДанные.ПубликацияВакансии) = Тип("СписокЗначений")
		И ТекущиеДанные.ПубликацияВакансии.Количество() > 0 Тогда
		НачальноеЗначение = СписокВыбора.НайтиПоЗначению(ТекущиеДанные.ПубликацияВакансии[0].Значение);
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора, , НачальноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыборЭлементаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхЗначений = Новый СписокЗначений;
	СписокВыбранныхЗначений.Добавить(ВыбранныйЭлемент.Значение, ВыбранныйЭлемент.Представление);
	ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = СписокВыбранныхЗначений;
	ПриИзмененииЗначенияПубликацииВакансии();
	
КонецПроцедуры

&НаКлиенте
Процедура МножественныйВыборИзСписка(ТекущиеДанные, СписокВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		
	Оповещение  = Новый ОписаниеОповещения("ПоказатьОтметкуЭлементовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	СписокВыбора.ПоказатьОтметкуЭлементов(Оповещение, НСтр("ru = 'Выберите'") + " " + ТекущиеДанные.Показатель);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтметкуЭлементовЗавершение(СписокЭлементов, ДополнительныеПараметры) Экспорт
	
	Если СписокЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхЗначений = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из СписокЭлементов Цикл
		
		Если ЭлементСписка.Пометка Тогда
			СписокВыбранныхЗначений.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = СписокВыбранныхЗначений;
	ПриИзмененииЗначенияПубликацииВакансии();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзДереваЗначений(СтруктураПараметров, ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("ВыборИзДереваЗначенийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.ВыборИзДереваЗначений";
	
	РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, СтруктураПараметров, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзДереваЗначенийЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено 
		Или ВыбранныйЭлемент = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = ВыбранныйЭлемент;
	ПриИзмененииЗначенияПубликацииВакансии();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеМногострочногоТекста(ТекущиеДанные) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеМногострочногоТекстаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстПодсказки = НСтр("ru = 'Введите'") + " " + ТекущиеДанные.Показатель;
	
	ПоказатьВводСтроки(Оповещение, ТекущиеДанные.ПубликацияВакансииТекст, ТекстПодсказки, 10000, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеМногострочногоТекстаЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = СократитьТекст(Строка);
	ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансииТекст = Строка;
	
	ПриИзмененииЗначенияПубликацииВакансии();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДерево(МассивПолейВакансии)
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений"));
	
	Дерево.Строки.Очистить();
	
	СтрокаВакансия = Дерево.Строки.Добавить();
	СтрокаВакансия.Показатель = Вакансия;
	СтрокаВакансия.ВакансияВПрограмме = Строка(Вакансия);
	СтрокаВакансия.ПубликацияВакансии = Строка(Вакансия);
	
	ДанныеПубликации = ДанныеПубликации(Вакансия, Сайт);
	
	Для Каждого Поле Из МассивПолейВакансии Цикл
		ВывестиСтрокуДерева(СтрокаВакансия.Строки, Поле, ДанныеПубликации);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоНастроек");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСтрокуДерева(Строки, Поле, ДанныеПубликации, ПутьРодителя = "")
	
	Если Не Поле.Использование Тогда
		Возврат;
	КонецЕсли;
	
	ПодчиненнаяСтрока = Строки.Добавить();
	ПодчиненнаяСтрока.Показатель = Поле.Описание;
	ПодчиненнаяСтрока.ТипРеквизита = Поле.ТипJSON;
	ПодчиненнаяСтрока.Путь = ?(ЗначениеЗаполнено(ПутьРодителя), "" + ПутьРодителя + ".", "") + Поле.Путь;
	ПодчиненнаяСтрока.ОбязательноеПоле = Поле.Обязательное;
	ПодчиненнаяСтрока.СвязанноеПолеПуть = Поле.СвязанноеПолеПуть;
	
	Если Поле.ТипJSON = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта() 
		Или Поле.ТипJSON = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива() 
		И ЗначениеЗаполнено(Поле.ПодчиненныеЭлементы) Тогда
		
		Если ЗначениеЗаполнено(Поле.ПодчиненныеЭлементы) Тогда
			
			Если Поле.ПодчиненныеЭлементы.Количество() = 1 Тогда
				ПодчиненнаяСтрока.Путь = ПодчиненнаяСтрока.Путь + "." + Поле.ПодчиненныеЭлементы[0].Путь;
			ИначеЕсли Поле.ПодчиненныеЭлементы.Количество() > 1 Тогда
				Для Каждого ПодчиненноеПоле Из Поле.ПодчиненныеЭлементы Цикл
					ВывестиСтрокуДерева(ПодчиненнаяСтрока.Строки, ПодчиненноеПоле, ДанныеПубликации, ПодчиненнаяСтрока.Путь);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначениеРеквизитаВакансии = РеквизитВакансииСоответствующийПолюПубликации(ПодчиненнаяСтрока.Путь);
	ПодчиненнаяСтрока.ВакансияВПрограмме = ЗначениеРеквизитаВакансии;
	Если ТипЗнч(ЗначениеРеквизитаВакансии) = Тип("Строка") Тогда
		ПодчиненнаяСтрока.ВакансияВПрограммеТекст = ЗначениеРеквизитаВакансии;
	КонецЕсли;
	
	Если ДанныеПубликации.Количество() = 0 Тогда
		
		ПодчиненнаяСтрока.ПубликацияВакансии = ЗначениеРеквизитаВакансии;
		Если ТипЗнч(ЗначениеРеквизитаВакансии) = Тип("Строка") Тогда
			
			Если ЭлементСодержитТекст(Поле.Путь, ЭлементыСМногострочнымВводом, ЭлементыСТекстомВHTML) Тогда
				ПодчиненнаяСтрока.ПубликацияВакансии = СократитьТекст(ПодчиненнаяСтрока.ПубликацияВакансии);
			КонецЕсли;
			
			Если ЭлементСТекстомВHTML(Поле.Путь, ЭлементыСТекстомВHTML)Тогда
				ПодчиненнаяСтрока.ПубликацияВакансииТекст = ТекстВHTML(ЗначениеРеквизитаВакансии);
			Иначе
				ПодчиненнаяСтрока.ПубликацияВакансииТекст = ЗначениеРеквизитаВакансии;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СтрокаДанных = ДанныеПубликации.Найти(ПодчиненнаяСтрока.Путь, "ПолеДанных");
		Если СтрокаДанных <> Неопределено Тогда
			
			ЗначениеИзРегистра = РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаДанных.Значение);
			
			Если ТипЗнч(ЗначениеИзРегистра) = Тип("Массив") Тогда
				ПодчиненнаяСтрока.ПубликацияВакансии = РекрутинговыеСайты.СписокЗначенийПоМассивуСтруктур(ЗначениеИзРегистра);
			Иначе
				
				Если ПодчиненнаяСтрока.ТипРеквизита = "Число" Тогда
					ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
					ПодчиненнаяСтрока.ПубликацияВакансии = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеИзРегистра);
				ИначеЕсли ПодчиненнаяСтрока.ТипРеквизита = "Булево" Тогда
					ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
					ПодчиненнаяСтрока.ПубликацияВакансии = ОписаниеТипаБулево.ПривестиЗначение(ЗначениеИзРегистра);
				Иначе
					
					ПодчиненнаяСтрока.ПубликацияВакансииТекст = ЗначениеИзРегистра;
					
					Если ЭлементСодержитТекст(Поле.Путь, ЭлементыСМногострочнымВводом, ЭлементыСТекстомВHTML) Тогда
						
						Если ЭлементСТекстомВHTML(Поле.Путь, ЭлементыСТекстомВHTML) Тогда
							ЗначениеИзРегистра = ИзвлечьТекстИзHTML(ЗначениеИзРегистра);
						КонецЕсли;
						
						ЗначениеИзРегистра = СократитьТекст(ЗначениеИзРегистра);
						
					КонецЕсли;
					
					ПодчиненнаяСтрока.ПубликацияВакансии = ЗначениеИзРегистра;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РеквизитВакансииСоответствующийПолюПубликации(Путь)
	
	Возврат РекрутинговыеСайтыСлужебный.РеквизитВакансииСоответствующийПолюПубликации(Путь, Вакансия, ДанныеСайтов[Сайт]);
	
КонецФункции

&НаСервере
Функция ОпубликоватьВакансию()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений"));
	
	Если ПроверитьЗаполнениеПолей(Дерево) Тогда
		Возврат РекрутинговыеСайты.ОпубликоватьВакансию(Вакансия, Сайт, Дерево);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПовторноОпубликоватьВакансию()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений"));
	
	Если ПроверитьЗаполнениеПолей(Дерево) Тогда
		Возврат РекрутинговыеСайты.ПовторноОпубликоватьВакансию(Вакансия, Сайт, Дерево, ИдентификаторВакансии);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОбновитьПубликациюВакансии()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНастроек", Тип("ДеревоЗначений"));
	
	Если ПроверитьЗаполнениеПолей(Дерево) Тогда
		Возврат РекрутинговыеСайты.ОбновитьПубликациюВакансии(Вакансия, Сайт, Дерево, ИдентификаторВакансии);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СинхронизироватьСвойстваПубликацииВакансии()
	
	Если ПервичнаяПубликация Тогда
		Возврат;
	КонецЕсли;
	
	Если РекрутинговыеСайты.СинхронизироватьСвойстваПубликацииВакансии(Вакансия, Сайт, ИдентификаторВакансии) Тогда
		
		ОбновленныеСвойства = РекрутинговыеСайты.СвойстваПубликацииВакансии(Вакансия, Сайт);
		ПовторнаяПубликация = ЗначениеЗаполнено(ОбновленныеСвойства.ДатаСнятияСПубликации);
		
		Если ПовторнаяПубликация И Не ДанныеСайтов[Сайт].ДоступнаПовторнаяПубликацияВакансий Тогда
			
			НастроитьРеквизитыДляНовойПубликации();
			
			ТекстСообщения = НСтр("ru = 'Повторная публикация вакансии на сайте не поддерживается.
				|При опубликовании будет размещена новая вакансия.'");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	Иначе
		
		НастроитьРеквизитыДляНовойПубликации();
		
		ТекстСообщения = НСтр("ru = 'Публикация вакансии на сайте не найдена или не доступна.
			|При опубликовании будет размещена новая вакансия.'");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеПубликации(Вакансия, Сайт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПубликацииВакансий.ПолеДанных,
	|	ДанныеПубликацииВакансий.Значение
	|ИЗ
	|	РегистрСведений.ДанныеПубликацииВакансий КАК ДанныеПубликацииВакансий
	|ГДЕ
	|	ДанныеПубликацииВакансий.Вакансия = &Вакансия
	|	И ДанныеПубликацииВакансий.МестоПубликации = &МестоПубликации";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("МестоПубликации", Сайт);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ОбновитьДерево(ОбновлениеПубликации)
	
	ПоляВакансии = РекрутинговыеСайты.ПоляВакансии(Сайт, ОбновлениеПубликации, ПовторнаяПубликация);
	ЗаполнитьДерево(ПоляВакансии);
	
КонецПроцедуры

&НаСервере
Функция СписокВыбораНаСервере(Путь)
	Возврат РекрутинговыеСайты.СписокВыбораПоКлассификатору(Сайт, Путь);
КонецФункции

&НаКлиенте
Процедура РедактированияСпискаТелефонов(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения(
		"ОткрытьСпециальнуюФормуРедактированияСпискаТелефоновЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокНомеров", ДополнительныеПараметры.СписокТелефонов);
	
	ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.РедактированиеТелефона";
	
	РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпециальнуюФормуРедактированияСпискаТелефоновЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИменаСвойств = ДанныеСайтов[Сайт].ИменаСвойствТелефона;
	
	Если Результат <> Неопределено 
		И ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		
		СписокТелефонов = Новый СписокЗначений;
		Для Каждого НомерТелефона Из Результат Цикл
			
			СтруктураТелефона = Новый Структура;
			СтруктураТелефона.Вставить(ИменаСвойств.КодСтраны, НомерТелефона.Значение.КодСтраны);
			СтруктураТелефона.Вставить(ИменаСвойств.КодГорода, НомерТелефона.Значение.КодГорода);
			СтруктураТелефона.Вставить(ИменаСвойств.НомерТелефона, НомерТелефона.Значение.НомерТелефона);
			СтруктураТелефона.Вставить(ИменаСвойств.Комментарий, НомерТелефона.Значение.Комментарий);
			
			СписокТелефонов.Добавить(СтруктураТелефона, ПредставлениеТелефона(НомерТелефона.Значение));
			
		КонецЦикла;
		
		ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = СписокТелефонов;
		ПриИзмененииЗначенияПубликацииВакансии();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеТелефона(СтруктураТелефона)
	
	Если ЗначениеЗаполнено(СтруктураТелефона.Комментарий) Тогда
		Возврат СтрШаблон("%1 (%2)%3 (%4)",
			СтруктураТелефона.КодСтраны,
			СтруктураТелефона.КодГорода,
			СтруктураТелефона.НомерТелефона,
			СтруктураТелефона.Комментарий);
	Иначе
		Возврат СтрШаблон("%1 (%2)%3",
			СтруктураТелефона.КодСтраны,
			СтруктураТелефона.КодГорода,
			СтруктураТелефона.НомерТелефона);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РедактированиеУровняВладенияЯзыками(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения(
		"ОткрытьСпециальнуюФормуРедактированияУровняВладенияЯзыкамиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокЯзыков", ДополнительныеПараметры.СписокЯзыков);
	ПараметрыФормы.Вставить("Сайт", Сайт);
	
	ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.РедактированиеУровняВладенияЯзыками";
	
	РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпециальнуюФормуРедактированияУровняВладенияЯзыкамиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИменаСвойств = ДанныеСайтов[Сайт].ИменаСвойствЗнанияЯзыка;
	
	Если Результат <> Неопределено 
		И ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		
		ЗнанияЯзыков = Новый СписокЗначений;
		Для Каждого ЗнаниеЯзыка Из Результат Цикл
			
			Язык = ЗнаниеЯзыка.Значение.Язык;
			Уровень = ЗнаниеЯзыка.Значение.Уровень;
			
			СтруктураЯзыка = Новый Структура;
			СтруктураЯзыка.Вставить(ИменаСвойств.ИдЯзыка, Язык[0].Значение);
			СтруктураЯзыка.Вставить(ИменаСвойств.НазваниеЯзыка, Язык[0].Представление);
			
			СтруктураУровня = Новый Структура;
			СтруктураУровня.Вставить(ИменаСвойств.ИдУровня, Уровень[0].Значение);
			СтруктураУровня.Вставить(ИменаСвойств.НазваниеУровня, Уровень[0].Представление);
			
			СтруктураЗнанияЯзыка = Новый Структура;
			СтруктураЗнанияЯзыка.Вставить(ИменаСвойств.ОбъектЯзык, СтруктураЯзыка);
			СтруктураЗнанияЯзыка.Вставить(ИменаСвойств.ОбъектУровень, СтруктураУровня);
			
			ЗнанияЯзыков.Добавить(СтруктураЗнанияЯзыка, СтрШаблон("%1 (%2)", Язык[0].Представление, Уровень[0].Представление));
			
		КонецЦикла;
		
		ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = ЗнанияЯзыков;
		ПриИзмененииЗначенияПубликацииВакансии();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТекстаВHTML(ТекущиеДанные) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("РедактированиеТекстаВHTMLЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ТекущиеДанные.Показатель);
	ПараметрыФормы.Вставить("ТекстВHTML", ТекущиеДанные.ПубликацияВакансииТекст);
	
	ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.РедактированиеТекстаВHTML";
	
	РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТекстаВHTMLЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) 
		И ТипЗнч(Результат) = Тип("Строка") Тогда
		
		ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансии = СократитьТекст(ИзвлечьТекстИзHTML(Результат));
		ДополнительныеПараметры.ТекущиеДанные.ПубликацияВакансииТекст = Результат;
		
		ПриИзмененииЗначенияПубликацииВакансии();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеПолей(Дерево)
	
	Отказ = Ложь;
	ОбязательныеПоляЗаполнены = Истина;
	СвязанныеПоля = Новый Соответствие;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если ТипЗнч(СтрокаДерева.Показатель) <> Тип("СправочникСсылка.Вакансии") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) 
				И СтрокаДереваПодчиненная.ОбязательноеПоле Тогда
				ОбязательныеПоляЗаполнены = Ложь;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДереваПодчиненная.СвязанноеПолеПуть) 
				И Не ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) Тогда
				
				СвязаннаяСтрока = СтрокаДерева.Строки.Найти(СтрокаДереваПодчиненная.СвязанноеПолеПуть, "Путь");
				Если СвязаннаяСтрока <> Неопределено 
					И Не ЗначениеЗаполнено(СвязаннаяСтрока.ПубликацияВакансии) Тогда
					
					Если СвязанныеПоля.Получить(СтрокаДереваПодчиненная.Показатель) = Неопределено Тогда 
						
						СвязанныеПоля.Вставить(СвязаннаяСтрока.Показатель, СтрокаДереваПодчиненная.Показатель);
						
						ТекстСообщения = СтрШаблон(НСтр("ru = 'Заполните поле ""%1"" или поле ""%2"".'"), СтрокаДереваПодчиненная.Показатель, СвязаннаяСтрока.Показатель);
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ОбязательныеПоляЗаполнены Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Заполните все обязательные поля.'"), , , , Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ОбновитьСсылкуНаВакансию()
	
	Если ПервичнаяПубликация Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПубликацияВакансий.Вакансия,
	|	ПубликацияВакансий.МестоПубликации,
	|	ПубликацияВакансий.АдресПубликации
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия = &Вакансия
	|	И ПубликацияВакансий.МестоПубликации = &МестоПубликации";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("МестоПубликации", Сайт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Элементы.СсылкаНаВакансию.Заголовок = Выборка.АдресПубликации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияПубликацииВакансии()
	
	ТекущиеДанные = Элементы.ДеревоНастроек.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.СтрокаИзменена = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТариф(Тарифы)
	
	СписокТарифов = Новый СписокЗначений();
	
	Для Каждого КлючИЗначение Из Тарифы Цикл
		СписокТарифов.Добавить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьТарифЗавершение", ЭтотОбъект);
	СписокТарифов.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите тариф для публикации вакансии.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТарифЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Подробности = "";
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Результат = ВыбратьТарифНаСервере(Сайт, ИдентификаторВакансии, ВыбранныйЭлемент.Значение);
		Если Результат.Успешно Тогда
			ОпубликоватьВакансиюЗавершение();
			Возврат;
		Иначе
			Подробности = Результат.ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РаботаСПубликациейЗавершение", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, СтрШаблон(
		НСтр("ru = 'Вакансия размещена на сайте, но не опубликована. Перейдите на сайт для публикации вакансии.
					|
					|%1'"), Подробности));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбратьТарифНаСервере(Сайт, Идентификатор, Тариф)
	
	Возврат РекрутинговыеСайты.ПрименитьТарифКВакансии(Сайт, Идентификатор, Тариф);
	
КонецФункции

&НаКлиенте
Процедура ОпубликоватьВакансиюЗавершение()
	
	Оповещение = Новый ОписаниеОповещения("РаботаСПубликациейЗавершение", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, НСтр("ru = 'Публикация вакансии прошла успешно.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПубликациюВакансииЗавершение()
	
	Оповещение = Новый ОписаниеОповещения("РаботаСПубликациейЗавершение", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, НСтр("ru = 'Обновление вакансии прошло успешно.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСПубликациейЗавершение(ДополнительныеПараметры) Экспорт
	
	Оповестить("ПубликацияВакансии");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьРазмещениеНовойВакансии(ТекстПричины)
	
	ПараметрыОповещения = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ПредложитьРазмещениеНовойВакансииЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ТекстВопроса = НСтр("ru = '%1
		|
		|Разместить новую вакансию (связь со старой будет потеряна)?'");
	
	ТекстВопроса = СтрШаблон(ТекстВопроса, ТекстПричины);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьРазмещениеНовойВакансииЗавершение(Ответ, Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		НастроитьФормуДляНовойПубликации();
		
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Проверьте поля и нажмите ""Опубликовать"".'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьРеквизитыДляНовойПубликации()
	
	ИдентификаторВакансии = "";
	Элементы.СсылкаНаВакансию.Заголовок = "";
	
	ПервичнаяПубликация = Истина;
	ПовторнаяПубликация = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляНовойПубликации()
	
	НастроитьРеквизитыДляНовойПубликации();
	
	НастроитьКомандыИДеревоНастроек();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПослеСозданияПубликации()
	
	ОбновитьСсылкуНаВакансию();
	
	ПервичнаяПубликация = Ложь;
	ПовторнаяПубликация = Истина;
	
	НастроитьКомандыИДеревоНастроек();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементСодержитТекст(ИмяЭлемента, ЭлементыСМногострочнымВводом, ЭлементыСТекстомВHTML)
	
	Возврат ЭлементСМногострочнымВводом(ИмяЭлемента, ЭлементыСМногострочнымВводом) 
		Или ЭлементСТекстомВHTML(ИмяЭлемента, ЭлементыСТекстомВHTML);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементСТекстомВHTML(ИмяЭлемента, ЭлементыСТекстомВHTML)
	
	Возврат ЗначениеЗаполнено(ЭлементыСТекстомВHTML) И ЭлементыСТекстомВHTML.Найти(ИмяЭлемента) <> Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭлементСМногострочнымВводом(ИмяЭлемента, ЭлементыСМногострочнымВводом)
	
	Возврат ЗначениеЗаполнено(ЭлементыСМногострочнымВводом) И ЭлементыСМногострочнымВводом.Найти(ИмяЭлемента) <> Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СократитьТекст(Знач ИсходныйТекст)
	
	Текст = СокрЛП(ИсходныйТекст);
	ДлинаТекста = СтрДлина(Текст);
	
	Если ДлинаТекста < 999 Тогда
		Возврат Текст;
	ИначеЕсли ДлинаТекста > 999 Тогда
		ДлинаТекста = 999;
		Текст = Лев(Текст, ДлинаТекста);
	КонецЕсли;
	
	ПозицияПробела = СтрНайти(Текст, " ", НаправлениеПоиска.СКонца);
	Если ДлинаТекста - ПозицияПробела < 3 Тогда
		ПозицияПробела = СтрНайти(Текст, " ", НаправлениеПоиска.СКонца, ПозицияПробела - 1);
	КонецЕсли;
	
	Текст = СтрШаблон("%1...", Сред(Текст, 1, ПозицияПробела));
	
	Возврат Текст;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИзвлечьТекстИзHTML(Знач ИсходныйТекст)
	
	Возврат РекрутинговыеСайтыКлиентСервер.ИзвлечьТекстИзHTML(ИсходныйТекст);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстВHTML(Знач ИсходныйТекст)
	
	ВыделитьФрагментТекста(ИсходныйТекст, НСтр("ru = 'Обязанности:'"));
	ВыделитьФрагментТекста(ИсходныйТекст, НСтр("ru = 'Требования:'"));
	ВыделитьФрагментТекста(ИсходныйТекст, НСтр("ru = 'Условия:'"));
	
	Возврат СтрЗаменить(ИсходныйТекст, Символы.ПС, "<br>");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьФрагментТекста(ИсходныйТекст, Фрагмент)
	
	ШаблонВыделения = СтрШаблон(НСтр("ru = '<span style=""font-weight: bold;"">%1</span>'"), Фрагмент);
	ИсходныйТекст = СтрЗаменить(ИсходныйТекст, Фрагмент, ШаблонВыделения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "ДеревоНастроек.ОбязательноеПоле", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "ДеревоНастроек.ПубликацияВакансии", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНастроекПубликацияВакансии.Имя);
	
КонецПроцедуры

#КонецОбласти
